---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface
source: html/cd4cf672-8bfd-8114-8ed9-54d6470838c2.htm
---
# EnergyAnalysisSurface Properties

The id of the assembly instance to which the element belongs.